/**
 * Created by coffee on 2015/4/30.
 */
angular.module('musicBox')
  .directive('box',function(){
  return {
    restrict: 'E',
    template: '<audio src="http://nie.dfe.yymommy.com/249bac8ff9f98e55/1430839369/mp3_190_0/ff/b5/ff2104d4b23144a42eb256934e13bfb5.mp3?s=t"></audio>',
    replace: true,
    link: function(scope, element, attr){

    }
  }
  })
  .directive('lrc',function(){
    return {
      restrict: 'E',
      templateUrl: 'app/musicBox/musicLrc.html',
      replace: true,
      link: function(scope, element, attr){
        var LrcElement = $(element).find('.lrc-list');
        var lrc = '"[ti:分手快乐]\n[ar:梁静如]\n[al:《Sunrise,我喜欢》]\n[by:百岛]\n[00:01.20]分手快乐\n[00:03.69]作词：姚若龙 作曲：郭文贤\n[00:05.82]演唱：梁静茹\n[00:39.43]我无法帮你预言\n[00:42.38]委曲求全 有没有用\n[00:45.92]可是我多么不舍\n[00:49.12]朋友爱得 那么苦痛\n[00:52.88]爱可以不问对错\n[00:56.04]至少有喜悦感动\n[00:58.42]如果他总为别人撑伞\n[01:01.91]你何苦非为他等在雨中\n[01:06.94]泡咖啡让你暖手\n[01:09.91]想挡挡你 心口里的风\n[01:13.93]你却想上街走走\n[01:16.89]吹吹冷风 会清醒得多\n[01:20.84]你说你不怕分手\n[01:23.82]只有一点遗憾难过\n[01:26.37]情人节就要来了\n[01:28.77]剩自己一个\n[01:30.62]其实爱对了人\n[01:32.49]情人节每天都过\n[01:36.54]分手快乐 祝你快乐\n[01:39.88]你可以找到更好的\n[01:43.39]不想过冬 厌倦沉重\n[01:46.74]就飞去热带的岛屿游泳\n[01:50.37]分手快乐 请你快乐\n[01:53.68]挥别错的才能和对的相逢\n[01:57.67]离开旧爱 像坐慢车\n[02:00.70]看透彻了心就会是晴朗的\n[02:04.75]没人能把谁的幸福没收\n[02:10.62]你发誓你会活得有笑容\n[02:51.21]泡咖啡让你暖手\n[02:54.28]想挡挡你 心口里的风\n[02:58.06]你却想上街走走\n[03:01.18]吹吹冷风 会清醒得多\n[03:05.02]你说你不怕分手\n[03:08.10]只有一点遗憾难过\n[03:10.65]情人节就要来了\n[03:13.16]剩自己一个\n[03:15.01]其实爱对了人\n[03:16.73]情人节每天都过\n[03:20.81]分手快乐 祝你快乐\n[03:24.14]你可以找到更好的\n[03:27.69]不想过冬 厌倦沉重\n[03:31.16]就飞去热带的岛屿游泳\n[03:34.64]分手快乐 请你快乐\n[03:37.98]挥别错的才能和对的相逢\n[03:42.02]离开旧爱 像坐慢车\n[03:45.05]看透彻了心就会是晴朗的\n[03:48.77]没人能把谁的幸福没收\n[03:55.50]你发誓你会活得有笑容\n[04:02.50]你自信时候真的美多了\n\n[00:00.001]好音质,天天动听!\n[00:00.009]\n[99:00.000]\n[99:00.100]好音质,天天动听!"';
        var list = LrcElement.parseLrcInit(lrc);
        console.log(list.timeList.length);
        if(list){
          /*生成歌词列表*/
          for(i in list.contentList){
            LrcElement.append(list.contentList[i]);
          }
        }
      },
      controller:function($scope, $rootScope){
        console.log('指令好难呀');
        var lrc = '"[ti:分手快乐]\n[ar:梁静如]\n[al:《Sunrise,我喜欢》]\n[by:百岛]\n[00:01.20]分手快乐\n[00:03.69]作词：姚若龙 作曲：郭文贤\n[00:05.82]演唱：梁静茹\n[00:39.43]我无法帮你预言\n[00:42.38]委曲求全 有没有用\n[00:45.92]可是我多么不舍\n[00:49.12]朋友爱得 那么苦痛\n[00:52.88]爱可以不问对错\n[00:56.04]至少有喜悦感动\n[00:58.42]如果他总为别人撑伞\n[01:01.91]你何苦非为他等在雨中\n[01:06.94]泡咖啡让你暖手\n[01:09.91]想挡挡你 心口里的风\n[01:13.93]你却想上街走走\n[01:16.89]吹吹冷风 会清醒得多\n[01:20.84]你说你不怕分手\n[01:23.82]只有一点遗憾难过\n[01:26.37]情人节就要来了\n[01:28.77]剩自己一个\n[01:30.62]其实爱对了人\n[01:32.49]情人节每天都过\n[01:36.54]分手快乐 祝你快乐\n[01:39.88]你可以找到更好的\n[01:43.39]不想过冬 厌倦沉重\n[01:46.74]就飞去热带的岛屿游泳\n[01:50.37]分手快乐 请你快乐\n[01:53.68]挥别错的才能和对的相逢\n[01:57.67]离开旧爱 像坐慢车\n[02:00.70]看透彻了心就会是晴朗的\n[02:04.75]没人能把谁的幸福没收\n[02:10.62]你发誓你会活得有笑容\n[02:51.21]泡咖啡让你暖手\n[02:54.28]想挡挡你 心口里的风\n[02:58.06]你却想上街走走\n[03:01.18]吹吹冷风 会清醒得多\n[03:05.02]你说你不怕分手\n[03:08.10]只有一点遗憾难过\n[03:10.65]情人节就要来了\n[03:13.16]剩自己一个\n[03:15.01]其实爱对了人\n[03:16.73]情人节每天都过\n[03:20.81]分手快乐 祝你快乐\n[03:24.14]你可以找到更好的\n[03:27.69]不想过冬 厌倦沉重\n[03:31.16]就飞去热带的岛屿游泳\n[03:34.64]分手快乐 请你快乐\n[03:37.98]挥别错的才能和对的相逢\n[03:42.02]离开旧爱 像坐慢车\n[03:45.05]看透彻了心就会是晴朗的\n[03:48.77]没人能把谁的幸福没收\n[03:55.50]你发誓你会活得有笑容\n[04:02.50]你自信时候真的美多了\n\n[00:00.001]好音质,天天动听!\n[00:00.009]\n[99:00.000]\n[99:00.100]好音质,天天动听!"';
        var time_now = 50.58;

        $rootScope.playLrc = function(time){
          var LrcElement = $('.lrc-list').find('li');
          var list = LrcElement.parseLrcInit(lrc);
          var index=LrcElement.parseLrc(list,time)-1;
          console.log(index);
          LrcElement.removeClass('active').eq(index).addClass('active');
        }
      }
    }
  })
;
